ktpss97094/firmware-protocol-verification-baseline/stm32f429/protocols/I2C/master/DMA_Mode/stm32f4xx-hal-driver/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32f4xx_it.h"
#include <stdio.h>
#include <string.h>
#include <stdbool.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;
DMA_HandleTypeDef hdma_i2c1_tx;
DMA_HandleTypeDef hdma_i2c1_rx;

/* USER CODE BEGIN PV */
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_I2C1_Init(void);
/* USER CODE BEGIN PFP */
extern unsigned int nondet_uint(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
uint16_t CBMC_SIZE = nondet_uint();
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
//   HAL_Init();

  /* USER CODE BEGIN Init */
  /* init() */
  hi2c1.Instance = I2C1;
  hi2c1.State = HAL_I2C_STATE_READY;
  hi2c1.Lock = HAL_UNLOCKED;
  hi2c1.Init.AddressingMode = nondet_uint();
  hi2c1.hdmatx = &hdma_i2c1_tx;
  hdma_i2c1_tx.Instance = DMA1_Stream6;
  hdma_i2c1_tx.State = HAL_DMA_STATE_READY;
  hdma_i2c1_tx.Lock = HAL_UNLOCKED;
  /* USER CODE END Init */

  /* Configure the system clock */
//   SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
//   MX_GPIO_Init();
//   MX_DMA_Init();
//   MX_I2C1_Init();
  /* USER CODE BEGIN 2 */
  __CPROVER_assume(0 <= CBMC_SIZE && CBMC_SIZE <= 3);
  uint8_t data[CBMC_SIZE];
  for (int i = 0; i < CBMC_SIZE; i++) {
      data[i] = nondet_uint() & 0xFF;
  }

  /* FUV */
  HAL_StatusTypeDef result = HAL_I2C_Master_Transmit_DMA(&hi2c1, nondet_uint() & 0xFFFF, data, CBMC_SIZE);
  
  const int B_F = 4 + 1;  // 3: SB, ADDR, (ADD10), BTF、1: DMA TC
  for (int k = 0; k < B_F; k++) {
    bool itevten = hi2c1.Instance->CR2 & I2C_CR2_ITEVTEN;
    bool itbufen = hi2c1.Instance->CR2 & I2C_CR2_ITBUFEN;
    bool iterren = hi2c1.Instance->CR2 & I2C_CR2_ITERREN;
    uint32_t s6cr = hdma_i2c1_tx.Instance->CR;
    uint32_t s6fcr = hdma_i2c1_tx.Instance->FCR;
    
    if (
      (s6cr & DMA_SxCR_HTIE) ||
      (s6cr & DMA_SxCR_TCIE) ||
      (s6cr & DMA_SxCR_TEIE) ||
      (s6fcr & DMA_SxFCR_FEIE) ||
      (s6cr & DMA_SxCR_DMEIE)
    ) {
      DMA1_Stream6_IRQHandler();
    }
    else if (
      (itevten && (hi2c1.Instance->SR1 & I2C_SR1_SB)) ||
      (itevten && (hi2c1.Instance->SR1 & I2C_SR1_ADDR)) ||
      (itevten && (hi2c1.Instance->SR1 & I2C_SR1_ADD10)) ||
      (itevten && (hi2c1.Instance->SR1 & I2C_SR1_STOPF)) ||
      (itevten && (hi2c1.Instance->SR1 & I2C_SR1_BTF)) ||
      (itevten && itbufen && (hi2c1.Instance->SR1 & I2C_SR1_TXE)) ||
      (itevten && itbufen && (hi2c1.Instance->SR1 & I2C_SR1_RXNE))
    ) {
      I2C1_EV_IRQHandler();
    } else if (
      (iterren && (hi2c1.Instance->SR1 & I2C_SR1_BERR)) ||
      (iterren && (hi2c1.Instance->SR1 & I2C_SR1_ARLO)) ||
      (iterren && (hi2c1.Instance->SR1 & I2C_SR1_AF)) ||
      (iterren && (hi2c1.Instance->SR1 & I2C_SR1_OVR)) ||
      (iterren && (hi2c1.Instance->SR1 & I2C_SR1_PECERR)) ||
      (iterren && (hi2c1.Instance->SR1 & I2C_SR1_TIMEOUT)) ||
      (iterren && (hi2c1.Instance->SR1 & I2C_SR1_SMBALERT))
    ) {
      I2C1_ER_IRQHandler();
    }
  }
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
//   while (1) {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
    
//   }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE3);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief I2C1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C1_Init(void)
{

  /* USER CODE BEGIN I2C1_Init 0 */

  /* USER CODE END I2C1_Init 0 */

  /* USER CODE BEGIN I2C1_Init 1 */

  /* USER CODE END I2C1_Init 1 */
  hi2c1.Instance = I2C1;
  hi2c1.Init.ClockSpeed = 400000;
  hi2c1.Init.DutyCycle = I2C_DUTYCYCLE_2;
  hi2c1.Init.OwnAddress1 = 0;
  hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c1.Init.OwnAddress2 = 0;
  hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  if (HAL_I2C_Init(&hi2c1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure Analogue filter
  */
  if (HAL_I2CEx_ConfigAnalogFilter(&hi2c1, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure Digital filter
  */
  if (HAL_I2CEx_ConfigDigitalFilter(&hi2c1, 0) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN I2C1_Init 2 */

  /* USER CODE END I2C1_Init 2 */

}

/**
  * Enable DMA controller clock
  */
static void MX_DMA_Init(void)
{

  /* DMA controller clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* DMA interrupt init */
  /* DMA1_Stream0_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);
  /* DMA1_Stream6_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Stream6_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Stream6_IRQn);

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	__disable_irq();
	while (1) {
	}
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
	   ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
